; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v8 ?v9)
             (pred_7 ?v10 ?v11)
             (pred_2 ?v8 ?v11)
             (pred_3 ?v12 ?v8 )
	     (pred_11 ?v8)
             (pred_8 ?v7)
             (pred_1 ?v10)
             (pred_9 ?v11)
             (pred_12 ?v8)
             (pred_6 ?v10)
             (pred_4 ?v8)
             (pred_10 ))



(:action op_2
:parameters (?v1 ?v5 ?v6 ?v3)
:precondition (and (pred_8 ?v1) (pred_8 ?v5) (pred_1 ?v6) (pred_9 ?v3)
          (pred_5 ?v1 ?v5) (pred_7 ?v6 ?v3)
                   (pred_2 ?v5 ?v3) (pred_11 ?v1) 
                   (pred_12 ?v5) (pred_6 ?v6))
:effect (and  (pred_4 ?v5) (not (pred_12 ?v5))))


(:action op_4
:parameters (?v1 ?v4)
:precondition (and (pred_8 ?v1) (pred_8 ?v4)
               (pred_11 ?v1) (pred_5 ?v1 ?v4) (pred_4 ?v4))
:effect (and (pred_11 ?v4) (not (pred_11 ?v1))))

(:action op_3
:parameters (?v1 ?v6)
:precondition (and (pred_8 ?v1) (pred_1 ?v6) 
                  (pred_11 ?v1) (pred_3 ?v6 ?v1) (pred_10 ))
:effect (and (pred_6 ?v6)
   (not (pred_3 ?v6 ?v1)) (not (pred_10 ))))


(:action op_5
:parameters (?v1 ?v13 ?v2)
:precondition (and (pred_8 ?v1) (pred_1 ?v13) (pred_1 ?v2)
                  (pred_11 ?v1) (pred_6 ?v2) (pred_3 ?v13 ?v1))
:effect (and (pred_6 ?v13) (pred_3 ?v2 ?v1)
        (not (pred_6 ?v2)) (not (pred_3 ?v13 ?v1))))

(:action op_1
:parameters (?v1 ?v6)
:precondition (and (pred_8 ?v1) (pred_1 ?v6) 
                  (pred_11 ?v1) (pred_6 ?v6))
:effect (and (pred_10 ) (pred_3 ?v6 ?v1) (not (pred_6 ?v6)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_23 obj_10 obj_26 obj_31 obj_09 obj_18 obj_24 obj_14 obj_21 obj_13 obj_27 obj_03 obj_29 obj_25 obj_04 obj_12 obj_16 obj_30 obj_07 obj_01 obj_20 obj_22 obj_28 obj_02 obj_19
    obj_17 obj_05 obj_08
    obj_15 obj_06 obj_11
    )

    (:init
       (pred_10)

       (pred_8 obj_23)
       (pred_8 obj_10)
       (pred_8 obj_26)
       (pred_8 obj_31)
       (pred_8 obj_09)
       (pred_8 obj_18)
       (pred_8 obj_24)
       (pred_8 obj_14)
       (pred_8 obj_21)
       (pred_8 obj_13)
       (pred_8 obj_27)
       (pred_8 obj_03)
       (pred_8 obj_29)
       (pred_8 obj_25)
       (pred_8 obj_04)
       (pred_8 obj_12)
       (pred_8 obj_16)
       (pred_8 obj_30)
       (pred_8 obj_07)
       (pred_8 obj_01)
       (pred_8 obj_20)
       (pred_8 obj_22)
       (pred_8 obj_28)
       (pred_8 obj_02)
       (pred_8 obj_19)
       (pred_9 obj_17)
       (pred_9 obj_05)
       (pred_9 obj_08)
       (pred_1 obj_15)
       (pred_1 obj_06)
       (pred_1 obj_11)

       (pred_5 obj_23 obj_18)
       (pred_5 obj_23 obj_10)
       (pred_5 obj_10 obj_24)
       (pred_5 obj_10 obj_26)
       (pred_5 obj_10 obj_23)
       (pred_5 obj_26 obj_14)
       (pred_5 obj_26 obj_31)
       (pred_5 obj_26 obj_10)
       (pred_5 obj_31 obj_21)
       (pred_5 obj_31 obj_09)
       (pred_5 obj_31 obj_26)
       (pred_5 obj_09 obj_13)
       (pred_5 obj_09 obj_31)
       (pred_5 obj_18 obj_27)
       (pred_5 obj_18 obj_24)
       (pred_5 obj_18 obj_23)
       (pred_5 obj_24 obj_03)
       (pred_5 obj_24 obj_14)
       (pred_5 obj_24 obj_10)
       (pred_5 obj_24 obj_18)
       (pred_5 obj_14 obj_29)
       (pred_5 obj_14 obj_21)
       (pred_5 obj_14 obj_26)
       (pred_5 obj_14 obj_24)
       (pred_5 obj_21 obj_25)
       (pred_5 obj_21 obj_13)
       (pred_5 obj_21 obj_31)
       (pred_5 obj_21 obj_14)
       (pred_5 obj_13 obj_04)
       (pred_5 obj_13 obj_09)
       (pred_5 obj_13 obj_21)
       (pred_5 obj_27 obj_12)
       (pred_5 obj_27 obj_03)
       (pred_5 obj_27 obj_18)
       (pred_5 obj_03 obj_16)
       (pred_5 obj_03 obj_29)
       (pred_5 obj_03 obj_24)
       (pred_5 obj_03 obj_27)
       (pred_5 obj_29 obj_30)
       (pred_5 obj_29 obj_25)
       (pred_5 obj_29 obj_14)
       (pred_5 obj_29 obj_03)
       (pred_5 obj_25 obj_07)
       (pred_5 obj_25 obj_04)
       (pred_5 obj_25 obj_21)
       (pred_5 obj_25 obj_29)
       (pred_5 obj_04 obj_01)
       (pred_5 obj_04 obj_13)
       (pred_5 obj_04 obj_25)
       (pred_5 obj_12 obj_20)
       (pred_5 obj_12 obj_16)
       (pred_5 obj_12 obj_27)
       (pred_5 obj_16 obj_22)
       (pred_5 obj_16 obj_30)
       (pred_5 obj_16 obj_03)
       (pred_5 obj_16 obj_12)
       (pred_5 obj_30 obj_28)
       (pred_5 obj_30 obj_07)
       (pred_5 obj_30 obj_29)
       (pred_5 obj_30 obj_16)
       (pred_5 obj_07 obj_02)
       (pred_5 obj_07 obj_01)
       (pred_5 obj_07 obj_25)
       (pred_5 obj_07 obj_30)
       (pred_5 obj_01 obj_19)
       (pred_5 obj_01 obj_04)
       (pred_5 obj_01 obj_07)
       (pred_5 obj_20 obj_22)
       (pred_5 obj_20 obj_12)
       (pred_5 obj_22 obj_28)
       (pred_5 obj_22 obj_16)
       (pred_5 obj_22 obj_20)
       (pred_5 obj_28 obj_02)
       (pred_5 obj_28 obj_30)
       (pred_5 obj_28 obj_22)
       (pred_5 obj_02 obj_19)
       (pred_5 obj_02 obj_07)
       (pred_5 obj_02 obj_28)
       (pred_5 obj_19 obj_01)
       (pred_5 obj_19 obj_02)
       (pred_12 obj_29)
       (pred_12 obj_01)
       (pred_12 obj_21)
       (pred_2  obj_29 obj_17)
       (pred_2  obj_01 obj_05)
       (pred_2  obj_21 obj_08)
       (pred_4 obj_23)
       (pred_4 obj_10)
       (pred_4 obj_26)
       (pred_4 obj_31)
       (pred_4 obj_09)
       (pred_4 obj_18)
       (pred_4 obj_24)
       (pred_4 obj_14)
       (pred_4 obj_13)
       (pred_4 obj_27)
       (pred_4 obj_03)
       (pred_4 obj_25)
       (pred_4 obj_04)
       (pred_4 obj_12)
       (pred_4 obj_16)
       (pred_4 obj_30)
       (pred_4 obj_07)
       (pred_4 obj_20)
       (pred_4 obj_22)
       (pred_4 obj_28)
       (pred_4 obj_02)
       (pred_4 obj_19)

       (pred_7  obj_15 obj_17)
       (pred_7  obj_06 obj_05)
       (pred_7  obj_11 obj_08)
       (pred_3 obj_15 obj_24)
       (pred_3 obj_06 obj_20)
       (pred_3 obj_11 obj_14)
       (pred_11 obj_02)
    )

    (:goal (and
       (pred_3 obj_11 obj_12)
    ))
(:constraints
  (always (not (pred_11 obj_27)))
)
)

; plan
1. (op_4 obj_02 obj_07)
   deleted: (pred_11 obj_02)
   added: (pred_11 obj_07)
   goals met: 0 of 1
2. (op_4 obj_07 obj_30)
   deleted: (pred_11 obj_07)
   added: (pred_11 obj_30)
   goals met: 0 of 1
3. (op_4 obj_30 obj_16)
   deleted: (pred_11 obj_30)
   added: (pred_11 obj_16)
   goals met: 0 of 1
4. (op_4 obj_16 obj_03)
   deleted: (pred_11 obj_16)
   added: (pred_11 obj_03)
   goals met: 0 of 1
5. (op_4 obj_03 obj_24)
   deleted: (pred_11 obj_03)
   added: (pred_11 obj_24)
   goals met: 0 of 1
6. (op_4 obj_24 obj_14)
   deleted: (pred_11 obj_24)
   added: (pred_11 obj_14)
   goals met: 0 of 1
7. (op_3 obj_14 obj_11)
   deleted: (pred_3 obj_11 obj_14) (pred_10)
   added: (pred_6 obj_11)
   goals met: 0 of 1
8. (op_4 obj_14 obj_24)
   deleted: (pred_11 obj_14)
   added: (pred_11 obj_24)
   goals met: 0 of 1
9. (op_4 obj_24 obj_03)
   deleted: (pred_11 obj_24)
   added: (pred_11 obj_03)
   goals met: 0 of 1
10. (op_4 obj_03 obj_16)
   deleted: (pred_11 obj_03)
   added: (pred_11 obj_16)
   goals met: 0 of 1
11. (op_4 obj_16 obj_12)
   deleted: (pred_11 obj_16)
   added: (pred_11 obj_12)
   goals met: 0 of 1
12. (op_1 obj_12 obj_11)
   deleted: (pred_6 obj_11)
   added: (pred_10) (pred_3 obj_11 obj_12)
   goals met: 1 of 1
